-- OPENTOMB SYSTEM CONSOLE NOTIFICATIONS
-- Russian translation by Lwmte, Apr 2015

--------------------------------------------------------------------------------
-- Here you have some global system console warnings which will frequently show.
--------------------------------------------------------------------------------

sys_notify[000]     = "Введите ID объекта!";
sys_notify[001]     = "Неверные аргументы, должно быть — %s.";
sys_notify[002]     = "Неверное число аргументов, должно быть %s.";
sys_notify[003]     = "Невозможно найти объект с ID #%d!";
sys_notify[004]     = "Неверный индекс параметра, %d — максимальный.";
sys_notify[005]     = "Нет актора для объекта #%d!";
sys_notify[006]     = "Неверный ID комнаты: #%d!";
sys_notify[007]     = "Нет моделей с ID #%d.";
sys_notify[008]     = "Неверный номер действия.";
sys_notify[009]     = "Невозможно создать шрифт. Возможно, достигнут максимум? (%d / %d)";
sys_notify[010]     = "Невозможно создать стиль. Возможно, достигнут максимум? (%d / %d)";
sys_notify[011]     = "Шрифт с заданным ID не существует или не удаляется!";
sys_notify[012]     = "Стиль с заданным ID не существует или не удаляется!";
sys_notify[013]     = "Невозможно найти скелетную модель с ID #%d!";
sys_notify[014]     = "Неверный номер анимации: #%d!";
sys_notify[015]     = "Неверный номер диспетчера анимации: #%d!";
sys_notify[016]     = "Неверный номер кадра: #%d!";
sys_notify[017]     = "Неверный номер потока. Должен быть больше или равен 0.";
sys_notify[018]     = "Неверный номер семпла. Должен быть в интервале от 0 до %d.";
sys_notify[019]     = "Ошибка Audio_Send: нет свободных каналов.";
sys_notify[020]     = "Ошибка Audio_Send: семпл не существует.";
sys_notify[021]     = "Audio_Send: семпл пропущен — повторите!";
sys_notify[022]     = "Audio_Kill: семпл #%d неактивен.";
sys_notify[023]     = "Статус флип-карты %d неактивен - комнаты не менялись!";
sys_notify[024]     = "Файл не найден — \"%s\"";
sys_notify[025]     = "Внимание: изображение %s не полноцветное — загрузка невозможна!";
sys_notify[026]     = "SDL не может загрузить изображение %s: ошибка %s";
sys_notify[027]     = "Неверное смещение кадра";
sys_notify[028]     = "Ошибка: невозможно открыть файл!";
sys_notify[029]     = "Ошибка: неверный формат файла!";
sys_notify[030]     = "Неверное число линий консоли!"
sys_notify[031]     = "Флип-карта %d не существует!";
sys_notify[032]     = "Шаблон волос с индексом %d не существует!";
sys_notify[033]     = "Невозможно создать волосы для персонажа %d!";
sys_notify[034]     = "У персонажа %d нет волос - нечего удалять.";

sys_notify[1000]    = "Открыт поток Ogg (%s): каналов = %d, частота = %d, битрейт = %.1f";
sys_notify[1001]    = "Читается файл: \"%s\"";
sys_notify[1002]    = "Загрузка вещи %i x%i в инвентарь актора %x";
sys_notify[1003]    = "Смена карты на номер %d";
sys_notify[1004]    = "Смена игры на номер %d";
sys_notify[1005]    = "Версия движка Tomb Raider: %d, карта: \"%s\"";
sys_notify[1006]    = "Количество комнат: %d";
sys_notify[1007]    = "Количество текстур: %d";
sys_notify[1008]    = "Межстрочный интервал в консоли: %f";
sys_notify[1009]    = "Число строк в консоли: %d";
sys_notify[1010]    = "ТРИГГЕР: таймер — %d, маска активации — %02X";
sys_notify[1011]    = "Активация объекта %d к %d";
sys_notify[1012]    = "Загрузка картинки фейдера: %s";
sys_notify[1013]    = "Успешная очистка массива триггеров!";
sys_notify[1014]    = "Успешная очистка массива функций объектов!";